[
  {
    "title": "Python for DevOps",
    "authors": [
      "Noah Gift",
      "Kennedy Behrman",
      "Alfredo Deza",
      "Grig Gheorghiu"
    ],
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2019-12-12",
    "description": "Much has changed in technology over the past decade. Data is hot, the cloud is ubiquitous, and many organizations need some form of automation. Throughout these transformations, Python has become one of the most popular languages in the world. This practical resource shows you how to use Python for everyday Linux systems administration tasks with today’s most useful DevOps tools, including Docker, Kubernetes, and Terraform. Learning how to interact and automate with Linux is essential for millions of professionals. Python makes it much easier. With this book, you’ll learn how to develop software and solve problems using containers, as well as how to monitor, instrument, load-test, and operationalize your software. Looking for effective ways to \"get stuff done\" in Python? This is your guide. Python foundations, including a brief introduction to the language How to automate text, write command-line tools, and automate the filesystem Linux utilities, package management, build systems, monitoring and instrumentation, and automated testing Cloud computing, infrastructure as code, Kubernetes, and serverless Machine learning operations and data engineering from a DevOps perspective Building, deploying, and operationalizing a machine learning project",
    "image": "http://books.google.com/books/content?id=gvrDDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 490,
    "isbn10": "1492057649",
    "isbn13": "9781492057642",
    "googleBooks": {
      "id": "gvrDDwAAQBAJ",
      "preview": "http://books.google.com/books?id=gvrDDwAAQBAJ&printsec=frontcover&dq=intitle:Python+for+DevOps:+Learn+Ruthlessly+Effective+Automation+by+Authors:+Kennedy+Behrman,+Grig+Gheorghiu,+Alfredo+Deza,+Noah+Gift&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=gvrDDwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=gvrDDwAAQBAJ"
    },
    "issueNumber": 7,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2025-02-24T08:29:00.000Z"
  },
  {
    "title": "Hands-On Python for DevOps",
    "authors": [
      "Ankur Roy"
    ],
    "publisher": "Packt Publishing Ltd",
    "publishedDate": "2024-03-15",
    "description": "Unleash DevOps excellence with Python and its ecosystem of tools for seamless orchestration on both local and cloud platforms, such as GCP, AWS, and Azure Key Features Integrate Python into DevOps for streamlined workflows, task automation, and improved collaboration Combine the principles of Python and DevOps into a unified approach for problem solving Learn about Python’s role in Infrastructure as Code (IaC), MLOps, networking, and other domains Purchase of the print or Kindle book includes a free PDF eBook Book DescriptionPython stands out as a powerhouse in DevOps, boasting unparalleled libraries and support, which makes it the preferred programming language for problem solvers worldwide. This book will help you understand the true flexibility of Python, demonstrating how it can be integrated into incredibly useful DevOps workflows and workloads, through practical examples. You'll start by understanding the symbiotic relation between Python and DevOps philosophies and then explore the applications of Python for provisioning and manipulating VMs and other cloud resources to facilitate DevOps activities. With illustrated examples, you’ll become familiar with automating DevOps tasks and learn where and how Python can be used to enhance CI/CD pipelines. Further, the book highlights Python’s role in the Infrastructure as Code (IaC) process development, including its connections with tools like Ansible, SaltStack, and Terraform. The concluding chapters cover advanced concepts such as MLOps, DataOps, and Python’s integration with generative AI, offering a glimpse into the areas of monitoring, logging, Kubernetes, and more. By the end of this book, you’ll know how to leverage Python in your DevOps-based workloads to make your life easier and save time.What you will learn Implement DevOps practices and principles using Python Enhance your DevOps workloads with Python Create Python-based DevOps solutions to improve your workload efficiency Understand DevOps objectives and the mindset needed to achieve them Use Python to automate DevOps tasks and increase productivity Explore the concepts of DevSecOps, MLOps, DataOps, and more Use Python for containerized workloads in Docker and Kubernetes Who this book is for This book is for IT professionals venturing into DevOps, particularly programmers seeking to apply their existing programming knowledge to excel in this field. For DevOps professionals without a coding background, this book serves as a resource to enhance their understanding of development practices and communicate more effectively with developers. Solutions architects, programmers, and anyone regularly working with DevOps solutions and Python will also benefit from this hands-on guide.",
    "image": "http://books.google.com/books/content?id=Iif2EAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 220,
    "isbn10": "1835081495",
    "isbn13": "9781835081495",
    "googleBooks": {
      "id": "Iif2EAAAQBAJ",
      "preview": "http://books.google.com/books?id=Iif2EAAAQBAJ&printsec=frontcover&dq=intitle:python+for+devops&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=Iif2EAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=Iif2EAAAQBAJ"
    },
    "issueNumber": 6,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2025-02-24T08:27:27.000Z"
  },
  {
    "title": "The Clean Coder",
    "authors": [
      "Robert C. Martin"
    ],
    "publisher": "Pearson Education",
    "publishedDate": "2011-05-13",
    "description": "Programmers who endure and succeed amidst swirling uncertainty and nonstop pressure share a common attribute: They care deeply about the practice of creating software. They treat it as a craft. They are professionals. In The Clean Coder: A Code of Conduct for Professional Programmers, legendary software expert Robert C. Martin introduces the disciplines, techniques, tools, and practices of true software craftsmanship. This book is packed with practical advice–about everything from estimating and coding to refactoring and testing. It covers much more than technique: It is about attitude. Martin shows how to approach software development with honor, self-respect, and pride; work well and work clean; communicate and estimate faithfully; face difficult decisions with clarity and honesty; and understand that deep knowledge comes with a responsibility to act. Readers will learn What it means to behave as a true software craftsman How to deal with conflict, tight schedules, and unreasonable managers How to get into the flow of coding, and get past writer’s block How to handle unrelenting pressure and avoid burnout How to combine enduring attitudes with new development paradigms How to manage your time, and avoid blind alleys, marshes, bogs, and swamps How to foster environments where programmers and teams can thrive When to say “No”–and how to say it When to say “Yes”–and what yes really means Great software is something to marvel at: powerful, elegant, functional, a pleasure to work with as both a developer and as a user. Great software isn’t written by machines. It is written by professionals with an unshakable commitment to craftsmanship. The Clean Coder will help you become one of them–and earn the pride and fulfillment that they alone possess.",
    "image": "http://books.google.com/books/content?id=ik0qCTVzl44C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "averageRating": 4,
    "ratingsCount": 4,
    "categories": [
      "Computers"
    ],
    "pageCount": 247,
    "isbn10": "0132542889",
    "isbn13": "9780132542883",
    "googleBooks": {
      "id": "ik0qCTVzl44C",
      "preview": "http://books.google.com/books?id=ik0qCTVzl44C&printsec=frontcover&dq=intitle:Clean+Code:+A+Handbook+of+Agile+Software+Craftsmanship&hl=&cd=5&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=ik0qCTVzl44C&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=ik0qCTVzl44C"
    },
    "issueNumber": 5,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2025-02-24T08:19:01.000Z"
  },
  {
    "title": "Test Driven Development",
    "authors": [
      "Kent Beck"
    ],
    "publisher": "Addison-Wesley Professional",
    "publishedDate": "2022-03-25",
    "description": "Quite simply, test-driven development is meant to eliminate fear in application development. While some fear is healthy (often viewed as a conscience that tells programmers to \"be careful!\"), the author believes that byproducts of fear include tentative, grumpy, and uncommunicative programmers who are unable to absorb constructive criticism. When programming teams buy into TDD, they immediately see positive results. They eliminate the fear involved in their jobs, and are better equipped to tackle the difficult challenges that face them. TDD eliminates tentative traits, it teaches programmers to communicate, and it encourages team members to seek out criticism However, even the author admits that grumpiness must be worked out individually! In short, the premise behind TDD is that code should be continually tested and refactored. Kent Beck teaches programmers by example, so they can painlessly and dramatically increase the quality of their work.",
    "image": "http://books.google.com/books/content?id=zNnPEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 241,
    "isbn10": "0137585233",
    "isbn13": "9780137585236",
    "googleBooks": {
      "id": "zNnPEAAAQBAJ",
      "preview": "http://books.google.com/books?id=zNnPEAAAQBAJ&pg=PA11&dq=intitle:%5Btest+issue%5D+clean+code&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=zNnPEAAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=zNnPEAAAQBAJ"
    },
    "issueNumber": 4,
    "progressPercent": 0,
    "state": "reading",
    "startedAt": "2025-02-24T08:16:47.000Z"
  },
  {
    "title": "Database Internals",
    "authors": [
      "Alex Petrov"
    ],
    "publisher": "\"O'Reilly Media, Inc.\"",
    "publishedDate": "2019-09-13",
    "description": "When it comes to choosing, using, and maintaining a database, understanding its internals is essential. But with so many distributed databases and tools available today, it’s often difficult to understand what each one offers and how they differ. With this practical guide, Alex Petrov guides developers through the concepts behind modern database and storage engine internals. Throughout the book, you’ll explore relevant material gleaned from numerous books, papers, blog posts, and the source code of several open source databases. These resources are listed at the end of parts one and two. You’ll discover that the most significant distinctions among many modern databases reside in subsystems that determine how storage is organized and how data is distributed. This book examines: Storage engines: Explore storage classification and taxonomy, and dive into B-Tree-based and immutable Log Structured storage engines, with differences and use-cases for each Storage building blocks: Learn how database files are organized to build efficient storage, using auxiliary data structures such as Page Cache, Buffer Pool and Write-Ahead Log Distributed systems: Learn step-by-step how nodes and processes connect and build complex communication patterns Database clusters: Which consistency models are commonly used by modern databases and how distributed storage systems achieve consistency",
    "image": "http://books.google.com/books/content?id=-F2vDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 442,
    "isbn10": "1492040304",
    "isbn13": "9781492040309",
    "googleBooks": {
      "id": "-F2vDwAAQBAJ",
      "preview": "http://books.google.com/books?id=-F2vDwAAQBAJ&printsec=frontcover&dq=intitle:Database+Internals&hl=&cd=1&source=gbs_api",
      "info": "https://play.google.com/store/books/details?id=-F2vDwAAQBAJ&source=gbs_api",
      "canonical": "https://play.google.com/store/books/details?id=-F2vDwAAQBAJ"
    },
    "issueNumber": 2,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2025-02-22T12:36:00.000Z",
    "completedAt": "2025-02-22T13:58:30.000Z",
    "timeToComplete": 4950000,
    "timeToCompleteFormatted": "1 hour"
  },
  {
    "title": "Understanding Distributed Systems",
    "authors": [
      "Roberto Vitillo"
    ],
    "publisher": "Roberto Vitillo",
    "publishedDate": "2021",
    "description": "Learning to build distributed systems is hard, especially if they are large scale. It's not that there is a lack of information out there. You can find academic papers, engineering blogs, and even books on the subject. The problem is that the available information is spread out all over the place, and if you were to put it on a spectrum from theory to practice, you would find a lot of material at the two ends, but not much in the middle. That is why I decided to write a book to teach the fundamentals of distributed systems so that you don’t have to spend countless hours scratching your head to understand how everything fits together. This is the guide I wished existed when I first started out, and it's based on my experience building large distributed systems that scale to millions of requests per second and billions of devices. If you develop the back-end of web or mobile applications (or would like to!), this book is for you. When building distributed systems, you need to be familiar with the network stack, data consistency models, scalability and reliability patterns, and much more. Although you can build applications without knowing any of that, you will end up spending hours debugging and re-designing their architecture, learning lessons that you could have acquired in a much faster and less painful way.",
    "image": "http://books.google.com/books/content?id=mthMEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "language": "en",
    "categories": [
      "Computers"
    ],
    "pageCount": 254,
    "isbn10": "1838430202",
    "isbn13": "9781838430207",
    "googleBooks": {
      "id": "mthMEAAAQBAJ",
      "preview": "http://books.google.com/books?id=mthMEAAAQBAJ&printsec=frontcover&dq=intitle:Understanding+Distributed+Systems&hl=&cd=1&source=gbs_api",
      "info": "http://books.google.com/books?id=mthMEAAAQBAJ&dq=intitle:Understanding+Distributed+Systems&hl=&source=gbs_api",
      "canonical": "https://books.google.com/books/about/Understanding_Distributed_Systems.html?hl=&id=mthMEAAAQBAJ"
    },
    "issueNumber": 1,
    "progressPercent": 0,
    "state": "completed",
    "startedAt": "2025-02-22T12:08:46.000Z",
    "completedAt": "2025-02-22T12:17:37.000Z",
    "timeToComplete": 531000,
    "timeToCompleteFormatted": "8 minutes"
  }
]
